Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisPartAnalysisProperties Property
 The analysis part analysis properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartAnalysisProperties AnalysisPartAnalysisProperties { get; set; }
Public Property AnalysisPartAnalysisProperties As AnalysisPartAnalysisProperties
	Get
	Set
Property Value
Type: AnalysisPartAnalysisProperties
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace